load-test-report/random-io-64kb-image.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process
test: Laying out IO file (1 file / 640MiB)

test: (groupid=0, jobs=1): err= 0: pid=1449: Tue Apr 15 07:24:19 2025
  read: IOPS=1275, BW=5101KiB/s (5224kB/s)(299MiB/60001msec)
    slat (usec): min=9, max=1028, avg=19.15, stdev=16.31
    clat (usec): min=3, max=7437, avg=761.71, stdev=264.88
     lat (usec): min=334, max=7461, avg=780.86, stdev=265.64
    clat percentiles (usec):
     |  1.00th=[  412],  5.00th=[  490], 10.00th=[  529], 20.00th=[  553],
     | 30.00th=[  578], 40.00th=[  603], 50.00th=[  652], 60.00th=[  766],
     | 70.00th=[  865], 80.00th=[  971], 90.00th=[ 1123], 95.00th=[ 1270],
     | 99.00th=[ 1582], 99.50th=[ 1713], 99.90th=[ 2024], 99.95th=[ 2245],
     | 99.99th=[ 2606]
   bw (  KiB/s): min= 4792, max= 5592, per=100.00%, avg=5102.05, stdev=179.40, samples=119
   iops        : min= 1198, max= 1398, avg=1275.51, stdev=44.85, samples=119
  lat (usec)   : 4=0.01%, 100=0.01%, 250=0.02%, 500=5.94%, 750=52.61%
  lat (usec)   : 1000=23.63%
  lat (msec)   : 2=17.68%, 4=0.11%, 10=0.01%
  cpu          : usr=1.07%, sys=3.84%, ctx=76525, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=76519,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5101KiB/s (5224kB/s), 5101KiB/s-5101KiB/s (5224kB/s-5224kB/s), io=299MiB (313MB), run=60001-60001msec

Disk stats (read/write):
  xvda: ios=76444/28, sectors=611552/904, merge=0/85, ticks=54194/24, in_queue=54218, util=90.65%