load-test-report/random-io-8kb-image.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.36
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=1566: Tue Apr 15 07:28:34 2025
  read: IOPS=1281, BW=5125KiB/s (5248kB/s)(300MiB/60001msec)
    slat (usec): min=9, max=910, avg=19.03, stdev=16.59
    clat (usec): min=3, max=8506, avg=758.27, stdev=263.41
     lat (usec): min=347, max=8519, avg=777.30, stdev=264.21
    clat percentiles (usec):
     |  1.00th=[  424],  5.00th=[  498], 10.00th=[  529], 20.00th=[  553],
     | 30.00th=[  578], 40.00th=[  603], 50.00th=[  644], 60.00th=[  758],
     | 70.00th=[  857], 80.00th=[  963], 90.00th=[ 1123], 95.00th=[ 1270],
     | 99.00th=[ 1598], 99.50th=[ 1713], 99.90th=[ 2008], 99.95th=[ 2147],
     | 99.99th=[ 2409]
   bw (  KiB/s): min= 4696, max= 5776, per=100.00%, avg=5125.61, stdev=209.70, samples=119
   iops        : min= 1174, max= 1444, avg=1281.39, stdev=52.43, samples=119
  lat (usec)   : 4=0.01%, 10=0.01%, 50=0.01%, 250=0.02%, 500=5.34%
  lat (usec)   : 750=54.31%, 1000=23.02%
  lat (msec)   : 2=17.21%, 4=0.10%, 10=0.01%
  cpu          : usr=1.20%, sys=3.68%, ctx=76882, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=76873,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=5125KiB/s (5248kB/s), 5125KiB/s-5125KiB/s (5248kB/s-5248kB/s), io=300MiB (315MB), run=60001-60001msec

Disk stats (read/write):
  xvda: ios=76728/232, sectors=613824/2488, merge=0/17, ticks=54312/227, in_queue=54540, util=91.01%